cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- edited with XMLSpy v2013 sp1 (http://www.altova.com) by Infineon Technologies AG (Infineon Technologies AG) -->
<!--Version of used XSLT processor: 2.0 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.10-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.4-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD_Schema_1_1.xsd">
	<name>TLE984x</name>
	<version>1.5</version>
	<description>SVD file</description>
	<vendor>Infineon Technologies AG</vendor>
	<vendorID>Infineon</vendorID>
	<licenseText>tbd</licenseText>
	<cpu>
		<name>CM0</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>false</mpuPresent>
		<fpuPresent>false</fpuPresent>
		<nvicPrioBits>2</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>ADC1</name>
			<description>ADC1</description>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL_STS</name>
					<description>ADC1 Control and Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STRTUP_DIS</name>
							<description>DPP1 Startup Disable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Startup Enable</name>
									<description>DPP1 Startup enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Startup Disable</name>
									<description>DPP1 Startup disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SW_CH_SEL</name>
							<description>Channel for software mode</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH12_EN</name>
									<description>Channel 12 enable</description>
									<value>0b1100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOC</name>
							<description>ADC1 End of Conversion (software mode)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pending</name>
									<description>conversion still running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Finished</name>
									<description>conversion has finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAL_SIGN</name>
							<description>Output of Comparator to Steer Gain / Offset calibration</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>READY</name>
							<description>HVADC Ready bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not ready</name>
									<description>Module in power down or in init phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ready</name>
									<description>set automatically 5 ADC clock cycles after module is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOS</name>
							<description>ADC1 Start of Sampling/Conversion (software mode)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>no conversion is started</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>conversion is started</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOOC</name>
							<description>ADC1 Start of Offset Calibration (software mode)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>no offset calibration is started</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>offset calibration is started</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD_N</name>
							<description>ADC1 Power Down Signal</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>POWER DOWN</name>
									<description>ADC1 is powered down</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>ADC1 is switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>ADC1 Status Register</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SD_FEEDB_ON</name>
							<description>Sigma Delta Feedback Loop</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOC_JITTER</name>
							<description>Programs Soc Clock Jitter</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0n</name>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.5n</name>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5.5n</name>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8n</name>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DAC_IN</name>
							<description>Programs the 2-bit DAC for functional test</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>added LSB</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>added LSB</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>added LSB</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>added LSB</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>................</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<description>Measurement Unit 1 Control Register 2</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CAL_EN</name>
							<description>Calibration Enable for Channels 0 to 11</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 calibration enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 calibration enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 calibration enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 calibration enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 calibration enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 calibration enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 calibration enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 calibration enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 calibration enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 calibration enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 calibration enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 calibration enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL3</name>
					<description>Measurement Unit 1 Control Register 3</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SAMPLE_TIME_LVCH</name>
							<description>Sample time of ADC1</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MICLK4</name>
									<description>4 MI_CLK clock periods(default)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK6</name>
									<description>6 MI_CLK clock periods</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK8</name>
									<description>8 MI_CLK clock periods</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK10</name>
									<description>10 MI_CLK clock periods</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK12</name>
									<description>12 MI_CLK clock periods</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK14</name>
									<description>14 MI_CLK clock periods</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK16</name>
									<description>16 MI_CLK clock periods</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK18</name>
									<description>18 MI_CLK clock periods</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK20</name>
									<description>20 MI_CLK clock periods</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK22</name>
									<description>22 MI_CLK clock periods</description>
									<value>0x9</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SAMPLE_TIME_HVCH</name>
							<description>Sample time of ADC1</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MICLK4</name>
									<description>4 MI_CLK clock periods</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK6</name>
									<description>6 MI_CLK clock periods</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK8</name>
									<description>8 MI_CLK clock periods</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK10</name>
									<description>10 MI_CLK clock periods</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK12</name>
									<description>12 MI_CLK clock periods (default)</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK14</name>
									<description>14 MI_CLK clock periods</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK16</name>
									<description>16 MI_CLK clock periods</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK18</name>
									<description>18 MI_CLK clock periods</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK20</name>
									<description>20 MI_CLK clock periods</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK22</name>
									<description>22 MI_CLK clock periods</description>
									<value>0x9</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_RDY</name>
							<description>Ready Signal for MCM after Power On or Reset</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM Not Ready</name>
									<description>Measurement Core Module in startup phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM Ready</name>
									<description>Measurement Core Module start-up phase finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EoC_FAIL</name>
							<description>Fail of ADC End of Conversion Signal</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC EoC available</name>
									<description>End of Conversion Signal was sent properly by ADC</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC EoC not available</name>
									<description>End of Conversion Signal was not sent properly by ADC</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EoC_FAIL_CLR</name>
							<description>Fail of ADC End of Conversion Signal Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC EoC Fail not clear</name>
									<description>no clear of EoC_FAIL flag</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC EoC Fail clear</name>
									<description>Clear of EoC_FAIL flag</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SW_MODE</name>
							<description>SW Mode Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Software Mode Disable</name>
									<description>Sequencer running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Software Mode Enabled</name>
									<description>Sequencer stopped</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_PD_N</name>
							<description>Power Down Signal for MCM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM Disabled</name>
									<description>Measurement Core Module Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM Enabled</name>
									<description>Measurement Core Module Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL4</name>
					<description>Measurement Unit 1 Control Register 4</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MAX_CALTIME</name>
							<description>Maximum ADC Calibration Time</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Sequence</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Sequences</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>Sequences</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Sequences</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5</name>
									<description>Sequence</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6</name>
									<description>Sequences</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>Sequences</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Sequences</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9</name>
									<description>Sequences</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10</name>
									<description>Sequences</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>11</name>
									<description>Sequences</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.</name>
									<description>Sequences</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>13</name>
									<description>Sequences</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>14</name>
									<description>Sequences</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15</name>
									<description>Sequences</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Sequences</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
