cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>CTRL5</name>
					<description>Measurement Unit 1 Control Register 5</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>FILT_OUT_SEL_11_0</name>
							<description>Output Filter Selection for Channels 0 to 11</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC1 Unfiltered Data can be monitored in the corresponding FILT_OUTx Registers</name>
									<value>0b000000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 0 IIR Data enabled for FILT_OUT0 Register</name>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 1 IIR Data enabled for FILT_OUT1 Register</name>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 2 IIR Data enabled for FILT_OUT2 Register</name>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 3 IIR Data enabled for FILT_OUT3 Register</name>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 4 IIR Data enabled for FILT_OUT4 Register</name>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 5 IIR Data enabled for FILT_OUT5 Register</name>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 6 IIR Data enabled for FILT_OUT6 Register</name>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 7 IIR Data enabled for FILT_OUT7 Register</name>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 8 IIR Data enabled for FILT_OUT8 Register</name>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 9 IIR Data enabled for FILT_OUT9 Register</name>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 10 IIR Data enabled for FILT_OUT10 Register</name>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 11 IIR Data enabled for FILT_OUT11 Register</name>
									<value>0b100000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>For Channels 11-0 IIR Data is enabled for FILT_OUTx Registers</name>
									<value>0b111111111111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ0_1</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 0-1</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ1</name>
							<description>Sequence 1 channel enable</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ0</name>
							<description>Sequence 0 channel enable</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ2_3</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 2-3</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ3</name>
							<description>Sequence 3 channel enable</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ2</name>
							<description>Sequence 2 channel enable</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ4_5</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 4-5</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ5</name>
							<description>Sequence 5 channel enable</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ4</name>
							<description>Sequence 4 channel enable</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ6_7</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 6-7</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ7</name>
							<description>Sequence 7 channel enable</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ6</name>
							<description>Sequence 6 channel enable</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
