cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>SQ8_9</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 8-9</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ9</name>
							<description>Sequence 9 channel enable</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ8</name>
							<description>Sequence 8 channel enable</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ10_11</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 10-11</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ11</name>
							<description>Sequence 11 channel enable</description>
							<lsb>16</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ10</name>
							<description>Sequence 10 channel enable</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ_FB</name>
					<description>Sequencer Feedback Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CHx</name>
							<description>Current ADC1 Channel</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0</name>
									<description>Channel 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>Channel 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>Channel 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>Channel 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>Channel 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>Channel 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6</name>
									<description>Channel 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7</name>
									<description>Channel 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8</name>
									<description>Channel 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9</name>
									<description>Channel 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10</name>
									<description>Channel 10 enable</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11</name>
									<description>Channel 11 enable</description>
									<value>0b1011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQx</name>
							<description>Current Active ADC1 Sequence</description>
							<lsb>11</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ8</name>
									<description>Sequence 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ9</name>
									<description>Sequence 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ10</name>
									<description>Sequence 10 enable</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ11</name>
									<description>Sequence 11 enable</description>
									<value>0b1011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_ACTIVE</name>
							<description>ADC1 ESM active</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>ESM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>ESM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_ACTIVE</name>
							<description>ADC1 EIM active</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>EIM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>EIM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_STOP</name>
							<description>ADC1 Sequencer Stop Signal for DPP</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DPP Running</name>
									<description>Postprocessing Sequencer in running mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DPP Stopped</name>
									<description>Postprocessing Sequencer stopped / Software Mode entered</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_FB</name>
							<description>Current Sequence that caused software mode</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0 enable</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1 enable</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2 enable</description>
									<value>0b00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3 enable</description>
									<value>0b00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4 enable</description>
									<value>0b00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5 enable</description>
									<value>0b00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6 enable</description>
									<value>0b00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7 enable</description>
									<value>0b00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ8</name>
									<description>Sequence 8 enable</description>
									<value>0b01000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ9</name>
									<description>Sequence 9 enable</description>
									<value>0b01001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ10</name>
									<description>Sequence 10 enable</description>
									<value>0b01010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ11</name>
									<description>Sequence 11 enable</description>
									<value>0b01011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ESM</name>
									<description>ESM</description>
									<value>0b11010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rfu</name>
									<value>0b11011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUSPEND_SW</name>
									<description>SW Mode per Flag</description>
									<value>0b11100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUSPEND_DBG</name>
									<description>Debug Suspend Mode</description>
									<value>0b11101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
