cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>CHx_EIM</name>
					<description>Channel Setting Bits for Exceptional Interrupt Measurement</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ADC1_EIM_TRIG_SEL</name>
							<description>Trigger selection for exceptional interrupt measurement (EIM)</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T6OUT</name>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T3OUT</name>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>t2_adc_trigger</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21</name>
									<description>t21_adc_trigger</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_EN</name>
							<description>Exceptional interrupt measurement (EIM) Trigger Event enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>start of EIM disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>start of IEM enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_REP</name>
							<description>Repeat count for exceptional interrupt measurement (EIM)</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Measurements</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Measurements</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Measurements</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Measurements</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Measurements</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>Measurements</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64</name>
									<description>Measurements</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128</name>
									<description>Measurements</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_CHx</name>
							<description>Channel set for exceptional interrupt measurement (EIM)</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rfu</name>
									<description>reserved for future use</description>
									<value>0b1100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_ESM</name>
					<description>Channel Setting Bits for Exceptional Sequence Measurement</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ESM_STS</name>
							<description>Exceptional Sequence Measurement is finished</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>Exceptional Sequence Measurement not done</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>done</name>
									<description>Exceptional Sequence Measurement done</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_EN</name>
							<description>Enable for Exceptional Sequence Measurement Trigger Event</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>start of ESM disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>start of ESM enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_ESM_TRIG_SEL</name>
							<description>Trigger selection for exceptional interrupt measurement (ESM)</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T6OUT</name>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T3OUT</name>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>t2_adc_trigger</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21</name>
									<description>t21_adc_trigger</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_0</name>
							<description>Channel Sequence for Exceptional Sequence Measurement (ESM)</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b000001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b000010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b000100000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b001000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0b010000000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0b100000000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MAX_TIME</name>
					<description>Maximum Time for Software Mode</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MAX_TIME</name>
							<description>Maximum Time in Software Mode</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min</name>
									<description>Software mode is immediately left</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max</name>
									<description>Software mode is active for 12.75 us</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH0_1</name>
					<description>Calibration for Channel 0 &amp; 1</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH1</name>
							<description>Gain Calibration for channel 1</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH1</name>
							<description>Offset Calibration for channel 1</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH0</name>
							<description>Gain Calibration for channel 0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH0</name>
							<description>Offset Calibration for channel 0</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH2_3</name>
					<description>Calibration for Channel 2 &amp; 3</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH3</name>
							<description>Gain Calibration for channel 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH3</name>
							<description>Offset Calibration for channel 3</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH2</name>
							<description>Gain Calibration for channel 2</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH2</name>
							<description>Offset Calibration for channel 2</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH4_5</name>
					<description>Calibration for Channel 4 &amp; 5</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH5</name>
							<description>Gain Calibration for channel 5</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH5</name>
							<description>Offset Calibration for channel 5</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH4</name>
							<description>Gain Calibration for channel 4</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH4</name>
							<description>Offset Calibration for channel 4</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH6_7</name>
					<description>Calibration for Channel 6 &amp; 7</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH7</name>
							<description>Gain Calibration for channel 7</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH7</name>
							<description>Offset Calibration for channel 7</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH6</name>
							<description>Gain Calibration for channel 6</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH6</name>
							<description>Offset Calibration for channel 6</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH8_9</name>
					<description>Calibration for Channel 8 &amp; 9</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH9</name>
							<description>Gain Calibration for channel 9</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH9</name>
							<description>Offset Calibration for channel 9</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH8</name>
							<description>Gain Calibration for channel 8</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH8</name>
							<description>Offset Calibration for channel 8</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH10_11</name>
					<description>Calibration for Channel 10 &amp; 11</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH11</name>
							<description>Gain Calibration for channel 11</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH11</name>
							<description>Offset Calibration for channel 11</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH10</name>
							<description>Gain Calibration for channel 10</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH10</name>
							<description>Offset Calibration for channel 10</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
