cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>STS_2</name>
					<description>ADC1 Status 2 Register</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>P2_7_UP_STS</name>
							<description>ADC1 Port 2.7 Upper Threshold Status</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_6_UP_STS</name>
							<description>ADC1 Port 2.6 Upper Threshold Status</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_3_UP_STS</name>
							<description>ADC1 Port 2.3 Upper Threshold Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_2_UP_STS</name>
							<description>ADC1 Port 2.2 Upper Threshold Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_1_UP_STS</name>
							<description>ADC1 Port 2.1 Upper Threshold Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_UP_STS</name>
							<description>ADC1 MON 5 Upper Threshold Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON4_UP_STS</name>
							<description>ADC1 MON 4 Upper Threshold Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3_UP_STS</name>
							<description>ADC1 MON 3 Upper Threshold Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2_UP_STS</name>
							<description>ADC1 MON 2 Upper Threshold Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1_UP_STS</name>
							<description>ADC1 MON 1 Upper Threshold Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UP_STS</name>
							<description>ADC1 VS Upper Threshold Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_7_LO_STS</name>
							<description>ADC1 Port 2.7 Lower Threshold Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_6_LO_STS</name>
							<description>ADC1 Port 2.6 Lower Threshold Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_3_LO_STS</name>
							<description>ADC1 Port 2.3 Lower Threshold Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_2_LO_STS</name>
							<description>ADC1 Port 2.2 Lower Threshold Status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2_1_LO_STS</name>
							<description>ADC1 Port 2.1 Lower Threshold Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_LO_STS</name>
							<description>ADC1 MON 5 Lower Threshold Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON4_LO_STS</name>
							<description>ADC1 MON 4 Lower Threshold Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3_LO_STS</name>
							<description>ADC1 MON 3 Lower Threshold Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2_LO_STS</name>
							<description>ADC1 MON 2 Lower Threshold Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1_LO_STS</name>
							<description>ADC1 MON 1 Lower Threshold Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_LO_STS</name>
							<description>ADC1 VS Lower Threshold Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STSCLR_1</name>
					<description>ADC1 Status Clear 1 Register</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DU4UP_SC</name>
							<description>ADC1 Differential Unit 4 (DU4) upper Channel Status Clear</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU upper Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU upper Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU4LO_SC</name>
							<description>ADC1 Differential Unit 4 (DU4) lower Channel Status Clear</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU lower Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU lower Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU3UP_SC</name>
							<description>ADC1 Differential Unit 3 (DU3) upper Channel Status Clear</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU upper Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU upper Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU3LO_SC</name>
							<description>ADC1 Differential Unit 3 (DU3) lower Channel Status Clear</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU lower Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU lower Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU2UP_SC</name>
							<description>ADC1 Differential Unit 2 (DU2) upper Channel Status Clear</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU upper Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU upper Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU2LO_SC</name>
							<description>ADC1 Differential Unit 2 (DU2) lower Channel Status Clear</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU lower Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU lower Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU1UP_SC</name>
							<description>ADC1 Differential Unit 1 (DU1) upper Channel Status Clear</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU upper Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU upper Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU1LO_SC</name>
							<description>ADC1 Differential Unit 1 (DU1) lower Channel Status Clear</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU lower Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU lower Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
