cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>FILTCOEFF0_7</name>
					<description>Filter Coefficients ADC Channel 0-7</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>A_CH7</name>
							<description>Filter Coefficient A for ADC channel 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH6</name>
							<description>Filter Coefficient A for ADC channel 6</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH5</name>
							<description>Filter Coefficient A for ADC channel 5</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH4</name>
							<description>Filter Coefficient A for ADC channel 4</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH3</name>
							<description>Filter Coefficient A for ADC channel 3</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH2</name>
							<description>Filter Coefficient A for ADC channel 2</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH1</name>
							<description>Filter Coefficient A for ADC channel 1</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH0</name>
							<description>Filter Coefficient A for ADC channel 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT0</name>
					<description>ADC or Filter Output Channel 0</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH0</name>
							<description>ADC or filter output value channel 0</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT1</name>
					<description>ADC or Filter Output Channel 1</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH1</name>
							<description>ADC or filter output value channel 1</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT2</name>
					<description>ADC or Filter Output Channel 2</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH2</name>
							<description>ADC or filter output value channel 2</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT3</name>
					<description>ADC or Filter Output Channel 3</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH3</name>
							<description>ADC or filter output value channel 3</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT4</name>
					<description>ADC or Filter Output Channel 4</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH4</name>
							<description>ADC or filter output value channel 4</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT5</name>
					<description>ADC or Filter Output Channel 5</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH5</name>
							<description>ADC or filter output value channel 5</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT6</name>
					<description>ADC or Filter Output Channel 6</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH6</name>
							<description>ADC or filter output value channel 6</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_UP_CTRL</name>
					<description>Upper Threshold Filter Enable</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>UPEN_Ch6</name>
							<description>Upper threshold IIR filter enable ch 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPEN_Ch5</name>
							<description>Upper threshold IIR filter enable ch 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPEN_Ch4</name>
							<description>Upper threshold IIR filter enable ch 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPEN_Ch3</name>
							<description>Upper threshold IIR filter enable ch 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPEN_Ch2</name>
							<description>Upper threshold IIR filter enable ch 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPEN_Ch1</name>
							<description>Upper threshold IIR filter enable ch 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPEN_Ch0</name>
							<description>Upper threshold IIR filter enable ch 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_LO_CTRL</name>
					<description>Lower Threshold Filter Enable</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>LOEN_Ch6</name>
							<description>Lower threshold IIR filter enable ch 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOEN_Ch5</name>
							<description>Lower threshold IIR filter enable ch 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOEN_Ch4</name>
							<description>Lower threshold IIR filter enable ch 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOEN_Ch3</name>
							<description>Lower threshold IIR filter enable ch 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOEN_Ch2</name>
							<description>Lower threshold IIR filter enable ch 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOEN_Ch1</name>
							<description>Lower threshold IIR filter enable ch 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOEN_Ch0</name>
							<description>Lower threshold IIR filter enable ch 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
