cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CCU6</name>
			<description>CCU6</description>
			<baseAddress>0x4000C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PISEL0</name>
					<description>Port Input Select Register 0</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>IST12HR</name>
							<description>Input Select for T12HR</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T12HRA</name>
									<description>Either signal T12HRA (if T12EXT = 0) or T12HRE (if T12EXT = 1) is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12HRB</name>
									<description>Either signal T12HRB (if T12EXT = 0) or T12HRF (if T12EXT = 1) is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12HRC</name>
									<description>Either signal T12HRC (if T12EXT = 0) or T12HRG (if T12EXT = 1) is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12HRD</name>
									<description>Either signal T12HRD (if T12EXT = 0) or T12HRH (if T12EXT = 1) is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISPOS2</name>
							<description>Input Select for CCPOS2</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCPOS2_0</name>
									<description>The input pin for CCPOS2_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS2_1</name>
									<description>The input pin for CCPOS2_1.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS2_2</name>
									<description>The input pin for CCPOS2_2.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS2_3</name>
									<description>The input pin for CCPOS2_3.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISPOS1</name>
							<description>Input Select for CCPOS1</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCPOS1_0</name>
									<description>The input pin for CCPOS1_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS1_1</name>
									<description>The input pin for CCPOS1_1.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS1_2</name>
									<description>The input pin for CCPOS1_2.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS1_3</name>
									<description>The input pin for CCPOS1_3.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISPOS0</name>
							<description>Input Select for CCPOS0</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCPOS0_0</name>
									<description>The input pin for CCPOS0_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS0_1</name>
									<description>The input pin for CCPOS0_1.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS0_2</name>
									<description>The input pin for CCPOS0_2.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS0_3</name>
									<description>The input pin for CCPOS0_3.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISTRP</name>
							<description>Input Select for CTRAP</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CTRAP_0</name>
									<description>The input pin for CTRAP_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTRAP_1</name>
									<description>The input pin for CTRAP_1.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTRAP_2</name>
									<description>The input pin for CTRAP_2.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTRAP_3</name>
									<description>signal from Differential Units.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCC62</name>
							<description>Input Select for CC62</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC62_0</name>
									<description>The input pin for CC62_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62_1</name>
									<description>The input pin for CC62_1.</description>
									<value>0b01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCC61</name>
							<description>Input Select for CC61</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC61_0</name>
									<description>The input pin for CC61_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61_1</name>
									<description>The input pin for CC61_1.</description>
									<value>0b01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCC60</name>
							<description>Input Select for CC60</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60_0</name>
									<description>The input pin for CC60_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC60_1</name>
									<description>The input pin for CC60_1.</description>
									<value>0b01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL2</name>
					<description>Port Input Select Register 2</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T13EXT</name>
							<description>Extension for T13HR Inputs</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T13HR[D:A]</name>
									<description>One of the signals T13HR[D:A] is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13HR[H:E]</name>
									<description>One of the signals T13HR[H:E] is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12EXT</name>
							<description>Extension for T12HR Inputs</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T12HR[D:A]</name>
									<description>One of the signals T12HR[D:A] is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12HR[H:E]</name>
									<description>One of the signals T12HR[H:E] is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCNT13</name>
							<description>Input Select for T13 Counting Input</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T13 prescaler</name>
									<description>The T13 prescaler generates the counting events. Bit TCTR4.T13CNT is not taken into account.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCTR4.T13CNT</name>
									<description>Bit TCTR4.T13CNT written with 1 is a counting event. The T13 prescaler is not taken into account.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Rising edge</name>
									<description>The timer T13 is counting each rising edge detected in the selected T13HR signal.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Falling Edge</name>
									<description>The timer T13 is counting each falling edge detected in the selected T13HR signal.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCNT12</name>
							<description>Input Select for T12 Counting Input</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T12 prescaler</name>
									<description>The T12 prescaler generates the counting events. Bit TCTR4.T12CNT is not taken into account.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCTR4.T12CNT</name>
									<description>Bit TCTR4.T12CNT written with 1 is a counting event. The T12 prescaler is not taken into account.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Rising edge</name>
									<description>The timer T12 is counting each rising edge detected in the selected T12HR signal.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Falling edge</name>
									<description>The timer T12 is counting each falling edge detected in the selected T12HR signal.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST13HR</name>
							<description>Input Select for T13HR</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T13HRA</name>
									<description>Either signal T13HRA (if T13EXT = 0) or T13HRE (if T13EXT = 1) is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13HRB</name>
									<description>Either signal T13HRB (if T13EXT = 0) or T13HRF (if T13EXT = 1) is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13HRC</name>
									<description>Either signal T13HRC (if T13EXT = 0) or T13HRG (if T13EXT = 1) is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13HRD</name>
									<description>Either signal T13HRD (if T13EXT = 0) or T13HRH (if T13EXT = 1) is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T12MSEL</name>
					<description>T12 Capture/Compare Mode Select Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DBYP</name>
							<description>Delay Bypass</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not active</name>
									<description>The delay bypass is not active. The dead-time counter DTC0 is generating a delay after the source signal becomes active.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Active</name>
									<description>The delay bypass is active. The dead-time counter DTC0 is not used by the sampling of the Hall pattern.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSYNC</name>
							<description>Hall Synchronization</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Any</name>
									<description>Any edge at one of the inputs CCPOSx (x = 0, 1, 2) triggers the sampling.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13 compare-match</name>
									<description>A T13 compare-match triggers the sampling.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13 period-match</name>
									<description>A T13 period-match triggers the sampling.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Hall</name>
									<description>The Hall sampling triggered by hardware sources is switched off.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 period-match</name>
									<description>A T12 period-match (while counting up) triggers the sampling.</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 one-match</name>
									<description>A T12 one-match (while counting down) triggers the sampling.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 compare-match UP</name>
									<description>A T12 compare-match of channel 0 (while counting up) triggers the sampling.</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 compare-match DOWN</name>
									<description>A T12 compare-match of channel 0 (while counting down) triggers the sampling.</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL62</name>
							<description>Capture/Compare Mode Selection</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Compare outputs disabled</name>
									<description>Compare outputs disabled, pins CC6n and COUT6n can be used for I/O. No capture action.</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pin CC6n, pin COUT6n</name>
									<description>Compare output on pin CC6n, pin COUT6n can be used for I/O. No capture action.</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pin COUT6n, Pin CC6n</name>
									<description>Compare output on pin COUT6n, pin CC6n can be used for I/O. No capture action.</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pins COUT6n and CC6n</name>
									<description>Compare output on pins COUT6n and CC6n.</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Double-Register Capture modes</name>
									<description>see .</description>
									<value>0b01XX</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Hall Sensor mode</name>
									<description>see . In order to enable the hall edge detection, all three MSEL6x must be programmed to Hall Sensor mode.</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Hysteresis-like mode</name>
									<description>see .</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Multi-Input Capture modes</name>
									<description>see .</description>
									<value>0b101X</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Multi-Input Capture modes</name>
									<description>see .</description>
									<value>0b11XX</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL61</name>
							<description>Capture/Compare Mode Selection</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Compare outputs disabled</name>
									<description>Compare outputs disabled, pins CC6n and COUT6n can be used for I/O. No capture action.</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pin CC6n, pin COUT6n</name>
									<description>Compare output on pin CC6n, pin COUT6n can be used for I/O. No capture action.</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pin COUT6n, Pin CC6n</name>
									<description>Compare output on pin COUT6n, pin CC6n can be used for I/O. No capture action.</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pins COUT6n and CC6n</name>
									<description>Compare output on pins COUT6n and CC6n.</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Double-Register Capture modes</name>
									<description>see .</description>
									<value>0b01XX</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Hall Sensor mode</name>
									<description>see . In order to enable the hall edge detection, all three MSEL6x must be programmed to Hall Sensor mode.</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Hysteresis-like mode</name>
									<description>see .</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Multi-Input Capture modes</name>
									<description>see .</description>
									<value>0b101X</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Multi-Input Capture modes</name>
									<description>see .</description>
									<value>0b11XX</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL60</name>
							<description>Capture/Compare Mode Selection</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Compare outputs disabled</name>
									<description>Compare outputs disabled, pins CC6n and COUT6n can be used for I/O. No capture action.</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pin CC6n, pin COUT6n</name>
									<description>Compare output on pin CC6n, pin COUT6n can be used for I/O. No capture action.</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pin COUT6n, Pin CC6n</name>
									<description>Compare output on pin COUT6n, pin CC6n can be used for I/O. No capture action.</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pins COUT6n and CC6n</name>
									<description>Compare output on pins COUT6n and CC6n.</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Double-Register Capture modes</name>
									<description>see .</description>
									<value>0b01XX</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Hall Sensor mode</name>
									<description>see . In order to enable the hall edge detection, all three MSEL6x must be programmed to Hall Sensor mode.</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Hysteresis-like mode</name>
									<description>see .</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Multi-Input Capture modes</name>
									<description>see .</description>
									<value>0b101X</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Multi-Input Capture modes</name>
									<description>see .</description>
									<value>0b11XX</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T12</name>
					<description>Timer T12 Counter Register</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T12CV</name>
							<description>Timer T12 Counter Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12PR</name>
					<description>Timer T12 Period Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T12PV</name>
							<description>T12 Period Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC60R</name>
					<description>Capture/Compare Register for Channel CC60</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel 0 Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC61R</name>
					<description>Capture/Compare Register for Channel CC61</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel 1 Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
