cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>CC62R</name>
					<description>Capture/Compare Register for Channel CC62</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel 2 Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC60SR</name>
					<description>Capture/Compare Shadow Register for Channel CC60</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel 0 Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC61SR</name>
					<description>Capture/Compare Shadow Register for Channel CC61</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel 1 Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC62SR</name>
					<description>Capture/Compare Shadow Register for Channel CC62</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel 2 Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12DTC</name>
					<description>Dead-Time Control Register for Timer T12 Low</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DTR2</name>
							<description>Dead-Time Run Indication Bit 2</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The value of the corresponding dead-time counter channel is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Zero</name>
									<description>The value of the corresponding dead-time counter channel is not 0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTR1</name>
							<description>Dead-Time Run Indication Bit 1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The value of the corresponding dead-time counter channel is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Zero</name>
									<description>The value of the corresponding dead-time counter channel is not 0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTR0</name>
							<description>Dead-Time Run Indication Bit 0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The value of the corresponding dead-time counter channel is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Zero</name>
									<description>The value of the corresponding dead-time counter channel is not 0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE2</name>
							<description>Dead-Time Enable Bit 2</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Dead-time generation is disabled. The corresponding outputs switch from the passive state to the active state (according to the actual compare status) without any delay.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Dead-time generation is enabled. The corresponding outputs switch from the passive state to the active state (according to the compare status) with the delay programmed in bit field DTM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE1</name>
							<description>Dead-Time Enable Bit 1</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Dead-time generation is disabled. The corresponding outputs switch from the passive state to the active state (according to the actual compare status) without any delay.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Dead-time generation is enabled. The corresponding outputs switch from the passive state to the active state (according to the compare status) with the delay programmed in bit field DTM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE0</name>
							<description>Dead-Time Enable Bit 0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Dead-time generation is disabled. The corresponding outputs switch from the passive state to the active state (according to the actual compare status) without any delay.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Dead-time generation is enabled. The corresponding outputs switch from the passive state to the active state (according to the compare status) with the delay programmed in bit field DTM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTM</name>
							<description>Dead-Time</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T13</name>
					<description>Timer T13 Counter Register</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T13CV</name>
							<description>Timer T13 Counter Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T13PR</name>
					<description>Timer T13 Period Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T13PV</name>
							<description>T13 Period Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC63R</name>
					<description>Capture/Compare Register for Channel CC63</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel CC63 Compare Value Low Byte</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC63SR</name>
					<description>Capture/Compare Shadow Register for Channel CC63</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel CC63 Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPSTAT</name>
					<description>Compare State Register</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T13IM</name>
							<description>T13 Inverted Modulation</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not inverted</name>
									<description>T13 output is not inverted.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Inverted</name>
									<description>T13 output is inverted for further modulation.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUT63PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUT62PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC62PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUT61PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC61PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUT60PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC60PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC63ST</name>
							<description>Capture/Compare State Bits</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Less</name>
									<description>In compare mode, the timer count is less than the compare value. In capture mode, the selected edge has not yet been detected since the bit has been reset by software the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Greater</name>
									<description>In compare mode, the counter value is greater than or equal to the compare value. In capture mode, the selected edge has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPOS2</name>
							<description>Sampled Hall Pattern Bit 2</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The input CCPOS2 has been sampled as 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The input CCPOS2 has been sampled as 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPOS1</name>
							<description>Sampled Hall Pattern Bit 1</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The input CCPOS1 has been sampled as 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The input CCPOS1 has been sampled as 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPOS0</name>
							<description>Sampled Hall Pattern Bit 0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The input CCPOS0 has been sampled as 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>One</name>
									<description>The input CCPOS0 has been sampled as 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC62ST</name>
							<description>Capture/Compare State Bits</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Less</name>
									<description>In compare mode, the timer count is less than the compare value. In capture mode, the selected edge has not yet been detected since the bit has been reset by software the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Greater</name>
									<description>In compare mode, the counter value is greater than or equal to the compare value. In capture mode, the selected edge has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC61ST</name>
							<description>Capture/Compare State Bits</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Less</name>
									<description>In compare mode, the timer count is less than the compare value. In capture mode, the selected edge has not yet been detected since the bit has been reset by software the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Greater</name>
									<description>In compare mode, the counter value is greater than or equal to the compare value. In capture mode, the selected edge has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC60ST</name>
							<description>Capture/Compare State Bits</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Less</name>
									<description>In compare mode, the timer count is less than the compare value. In capture mode, the selected edge has not yet been detected since the bit has been reset by software the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Greater</name>
									<description>In compare mode, the counter value is greater than or equal to the compare value. In capture mode, the selected edge has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
