cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>CMPMODIF</name>
					<description>Compare State Modification Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MCC63R</name>
							<description>Capture/Compare Status Modification Bits (Reset)</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not changed</name>
									<description>Bit CC63ST is not changed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC63ST is reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCC62R</name>
							<description>Capture/Compare Status Modification Bit 2(Reset)</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not changed</name>
									<description>Bit CC62ST is not changed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC62ST is reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCC61R</name>
							<description>Capture/Compare Status Modification Bit 1(Reset)</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not changed</name>
									<description>Bit CC61ST is not changed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC61ST is reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCC60R</name>
							<description>Capture/Compare Status Modification Bit 0(Reset)</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not changed</name>
									<description>Bit CC60ST is not changed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC60ST is reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCC63S</name>
							<description>Capture/Compare Status Modification Bits (Set)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not changed</name>
									<description>Bit CC63ST is not changed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC63ST is set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCC62S</name>
							<description>Capture/Compare Status Modification Bit 2 (Set)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not changed</name>
									<description>Bit CC62ST is not changed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC62ST is set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCC61S</name>
							<description>Capture/Compare Status Modification Bit 1 (Set)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not changed</name>
									<description>Bit CC61ST is not changed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC61ST is set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCC60S</name>
							<description>Capture/Compare Status Modification Bit 0 (Set)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not changed</name>
									<description>Bit CC60ST is not changed.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC60ST is set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR0</name>
					<description>Timer Control Register 0</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STE13</name>
							<description>Timer T13 Shadow Transfer Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The shadow register transfer is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The shadow register transfer is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13R</name>
							<description>Timer T13 Run Bit</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Stop</name>
									<description>Timer T13 is stopped.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Run</name>
									<description>Timer T13 is running.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13PRE</name>
							<description>Timer T13 Prescaler Bit</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The additional prescaler for T13 is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The additional prescaler for T13 is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13CLK</name>
							<description>Timer T13 Input Clock Select</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>fT13 = fCCU</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>fT13 = fCCU / 2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>fT13 = fCCU / 4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>fT13 = fCCU / 8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>fT13 = fCCU / 16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>fT13 = fCCU / 32</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64</name>
									<description>fT13 = fCCU / 64</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128</name>
									<description>fT13 = fCCU / 128</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTM</name>
							<description>T12 Operating Mode</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Edge-aligned Mode</name>
									<description>T12 always counts up and continues counting from zero after reaching the period value.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Center-aligned Mode</name>
									<description>T12 counts down after detecting a period-match and counts up after detecting a one-match.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDIR</name>
							<description>Count Direction of Timer T12</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UP</name>
									<description>T12 counts up.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOWN</name>
									<description>T12 counts down.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STE12</name>
							<description>Timer T12 Shadow Transfer Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The shadow register transfer is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The shadow register transfer is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12R</name>
							<description>Timer T12 Run Bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Stop</name>
									<description>Timer T12 is stopped.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Run</name>
									<description>Timer T12 is running.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12PRE</name>
							<description>Timer T12 Prescaler Bit</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The additional prescaler for T12 is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The additional prescaler for T12 is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12CLK</name>
							<description>Timer T12 Input Clock Select</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>fT12 = fCCU</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>fT12 = fCCU / 2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>fT12 = fCCU / 4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>fT12 = fCCU / 8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>fT12 = fCCU / 16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>fT12 = fCCU / 32</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64</name>
									<description>fT12 = fCCU / 64</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128</name>
									<description>fT12 = fCCU / 128</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR2</name>
					<description>Timer Control Register 2</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T13RSEL</name>
							<description>Timer T13 External Run Selection</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The external setting of T13R is disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Rising edge</name>
									<description>Bit T13R is set if a rising edge of signal T13HR is detected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Falling edge</name>
									<description>Bit T13R is set if a falling edge of signal T13HR is detected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Edge</name>
									<description>Bit T13R is set if an edge of signal T13HR is detected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12RSEL</name>
							<description>Timer T12 External Run Selection</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The external setting of T12R is disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Rising edge</name>
									<description>Bit T12R is set if a rising edge of signal T12HR is detected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Falling edge</name>
									<description>Bit T12R is set if a falling edge of signal T12HR is detected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Edge</name>
									<description>Bit T12R is set if an edge of signal T12HR is detected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13TED</name>
							<description>Timer T13 Trigger Event Direction</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Up</name>
									<description>while T12 is counting up</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Down</name>
									<description>while T12 is counting down</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Independent</name>
									<description>independent on the count direction of T12</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13TEC</name>
							<description>T13 Trigger Event Control</description>
							<lsb>2</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 0</name>
									<description>set T13R on a T12 compare event on channel 0</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 1</name>
									<description>set T13R on a T12 compare event on channel 1</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 2</name>
									<description>set T13R on a T12 compare event on channel 2</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 0,1,2</name>
									<description>set T13R on any T12 compare event on the channels 0, 1, or 2</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Period-match</name>
									<description>set T13R upon a period-match of T12</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Zero-match</name>
									<description>set T13R upon a zero-match of T12 (while counting up)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOSx</name>
									<description>set T13R on any edge of inputs CCPOSx</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13SSC</name>
							<description>Timer T13 Single Shot Control</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<description>No hardware action on T13R</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The single-shot mode is enabled, the bit T13R is reset by hardware if T13 reaches its period value. In parallel to the reset action of bit T13R, the bit CC63ST is reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12SSC</name>
							<description>Timer T12 Single Shot Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The single-shot mode is disabled, no hardware action on T12R.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The single shot mode is enabled, the bit T12R is reset by hardware if: – T12 reaches its period value in edge-aligned mode – T12 reaches the value 1 while down counting in center-aligned mode. In parallel to the reset action of bit T12R, the bits CC6xST (x = 0, 1, 2) are reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
