cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>TCTR4</name>
					<description>Timer Control Register 4</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T13STD</name>
							<description>Timer T13 Shadow Transfer Disable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STE13 reset</name>
									<description>STE13 is reset without triggering the shadow transfer.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13STR</name>
							<description>Timer T13 Shadow Transfer Request</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STE13 set</name>
									<description>STE13 is set, enabling the shadow transfer.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13CNT</name>
							<description>Timer T13 Count Event</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Count</name>
									<description>If enabled (PISEL2), timer T13 counts one step.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13RES</name>
							<description>Timer T13 Reset</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No effect</name>
									<description>No effect on T13.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Zero</name>
									<description>The T13 counter register is reset to zero. The switching of the output signals is according to the switching rules. Setting of T13RES has no impact on bit T13R.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13RS</name>
							<description>Timer T13 Run Set</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No influence</name>
									<description>T13R is not influenced.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13R set</name>
									<description>T13R is set, T13 counts.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13RR</name>
							<description>Timer T13 Run Reset</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No influence</name>
									<description>T13R is not influenced.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13R cleared</name>
									<description>T13R is cleared, T13 stops counting.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12STD</name>
							<description>Timer T12 Shadow Transfer Disable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STE12 reset</name>
									<description>STE12 is reset without triggering the shadow transfer.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12STR</name>
							<description>Timer T12 Shadow Transfer Request</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STE12 set</name>
									<description>STE12 is set, enabling the shadow transfer.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12CNT</name>
							<description>Timer T12 Count Event</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Count</name>
									<description>If enabled (PISEL2), timer T12 counts one step.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTRES</name>
							<description>Dead-Time Counter Reset</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No effect</name>
									<description>No effect on the dead-time counters.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Zero</name>
									<description>The three dead-time counter channels are reset to zero.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12RES</name>
							<description>Timer T12 Reset</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No effect</name>
									<description>No effect on T12.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Zero</name>
									<description>The T12 counter register is reset to zero. The switching of the output signals is according to the switching rules. Setting of T12RES has no impact on bit T12R.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12RS</name>
							<description>Timer T12 Run Set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No influence</name>
									<description>T12R is not influenced.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12R set</name>
									<description>T12R is set, T12 counts.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12RR</name>
							<description>Timer T12 Run Reset</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No influence</name>
									<description>T12R is not influenced.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12R cleared</name>
									<description>T12R is cleared, T12 stops counting.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODCTR</name>
					<description>Modulation Control Register</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ECT13O</name>
							<description>Enable Compare Timer T13 Output</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The alternate output function COUT63 is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The alternate output function COUT63 is enabled for the PWM signal generated by T13.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13MODEN</name>
							<description>T13 Modulation Enable</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The modulation of the corresponding output signal by a T13 PWM pattern is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The modulation of the corresponding output signal by a T13 PWM pattern is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCMEN</name>
							<description>Multi-Channel Mode Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The modulation of the corresponding output signal by a multi-channel pattern according to bit field MCMOUT is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The modulation of the corresponding output signal by a multi-channel pattern according to bit field MCMOUT is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12MODEN</name>
							<description>T12 Modulation Enable</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The modulation of the corresponding output signal by a T12 PWM pattern is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The modulation of the corresponding output signal by a T12 PWM pattern is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TRPCTR</name>
					<description>Trap Control Register</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TRPPEN</name>
							<description>Trap Pin Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The trap functionality based on the input pin CTRAP is disabled. A trap can only be generated by software by setting bit TRPF.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The trap functionality based on the input pin CTRAP is enabled. A trap can be generated by software by setting bit TRPF or by CTRAP = 0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPEN13</name>
							<description>Trap Enable Control for Timer T13</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The trap functionality for T13 is disabled. Timer T13 (if selected and enabled) provides PWM functionality even while TRPS = 1.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The trap functionality for T13 is enabled. The timer T13 PWM output signal is set to the passive state while TRPS = 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPEN</name>
							<description>Trap Enable Control</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The trap functionality of the corresponding output signal is disabled. The output state is independent from bit TRPS.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The trap functionality of the corresponding output signal is enabled. The output is set to the passive state while TRPS = 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPM2</name>
							<description>Trap Mode Control Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Hardware reset</name>
									<description>The trap state can be left (return to normal operation = bit TRPS = 0) as soon as the input CTRAP becomes inactive. Bit TRPF is automatically cleared by hardware if the input pin CTRAP becomes 1. Bit TRPS is automatically cleared by hardware if bit TRPF is 0 and if the synchronization condition (according to TRPM10) is detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Software reset</name>
									<description>The trap state can be left (return to normal operation = bit TRPS = 0) as soon as bit TRPF is reset by software after the input CTRAP becomes inactive (TRPF is not cleared by hardware). Bit TRPS is automatically cleared by hardware if bit TRPF = 0 and if the synchronization condition (according to TRPM10) is detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPM10</name>
							<description>Trap Mode Control Bits 1, 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T12 zero-match</name>
									<description>The trap state is left (return to normal operation according to TRPM2) when a zero-match of T12 (while counting up) is detected (synchronization to T12).</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13 zero-match</name>
									<description>The trap state is left (return to normal operation according to TRPM2) when a zero-match of T13 is detected (synchronization to T13).</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Immediately</name>
									<description>The trap state is left (return to normal operation according to TRPM2) immediately without any synchronization to T12 or T13.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PSLR</name>
					<description>Passive State Level Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PSL63</name>
							<description>Passive State Level of Output COUT63</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Level 0</name>
									<description>The passive level is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Level 1</name>
									<description>The passive level is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PSL</name>
							<description>Compare Outputs Passive State Level</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Level 0</name>
									<description>The passive level is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Level 1</name>
									<description>The passive level is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MCMOUTS</name>
					<description>Multi-Channel Mode Output Shadow Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STRHP</name>
							<description>Shadow Transfer Request for the Hall Pattern</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>by Hardware</name>
									<description>The bit fields CURH and EXPH are updated according to the defined hardware action. The write access to bit fields CURHS and EXPHS does not modify the bit fields CURH and EXPH.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>by Software</name>
									<description>The bit fields CURH and EXPH are updated by the value written to the bit fields CURHS and EXPHS.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CURHS</name>
							<description>Current Hall Pattern Shadow</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EXPHS</name>
							<description>Expected Hall Pattern Shadow</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STRMCM</name>
							<description>Shadow Transfer Request for MCMPS</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>by Hardware</name>
									<description>Bit field MCMP is updated according to the defined hardware action. The write access to bit field MCMPS does not modify bit field MCMP.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>by Software</name>
									<description>Bit field MCMP is updated by the value written to bit field MCMPS.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCMPS</name>
							<description>Multi-Channel PWM Pattern Shadow</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCMOUT</name>
					<description>Multi-Channel Mode Output Register</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CURH</name>
							<description>Current Hall Pattern</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EXPH</name>
							<description>Expected Hall Pattern</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>R</name>
							<description>Reminder Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No shadow transfer</name>
									<description>Currently, no shadow transfer from MCMPS to MCMP is requested.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Shadow transfer</name>
									<description>A shadow transfer from MCMPS to MCMP has been requested by the selected trigger source, but it has not yet been executed, because the selected synchronization condition has not yet occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCMP</name>
							<description>Multi-Channel PWM Pattern</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Passive</name>
									<description>The output is set to the passive state. The PWM generated by T12 or T13 is not taken into account.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>The output can deliver the PWM generated by T12 or T13 (according to register MODCTR).</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
