cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>ISS</name>
					<description>Capture/Compare Interrupt Status Set Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SSTR</name>
							<description>Set STR Flag</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit STR in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SIDLE</name>
							<description>Set IDLE Flag</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit IDLE in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SWHE</name>
							<description>Set Wrong Hall Event Flag</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit WHE in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCHE</name>
							<description>Set Correct Hall Event Flag</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CHE in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SWHC</name>
							<description>Software Hall Compare</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>The Hall compare action is triggered.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STRPF</name>
							<description>Set Trap Flag</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bits TRPF and TRPS in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ST13PM</name>
							<description>Set Timer T13 Period-Match Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit T13PM in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ST13CM</name>
							<description>Set Timer T13 Compare-Match Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit T13CM in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ST12PM</name>
							<description>Set Timer T12 Period-Match Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit T12PM in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ST12OM</name>
							<description>Set Timer T12 One-Match Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit T12OM in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCC62F</name>
							<description>Set Capture, Compare-Match Falling Edge Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC62F in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCC62R</name>
							<description>Set Capture, Compare-Match Rising Edge Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC62R in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCC61F</name>
							<description>Set Capture, Compare-Match Falling Edge Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC61F in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCC61R</name>
							<description>Set Capture, Compare-Match Rising Edge Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC61R in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCC60F</name>
							<description>Set Capture, Compare-Match Falling Edge Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC60F in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCC60R</name>
							<description>Set Capture, Compare-Match Rising Edge Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Bit CC60R in register IS will be set.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<description>Capture/Compare Interrupt Status Reset Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RSTR</name>
							<description>Reset STR Flag</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit STR in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIDLE</name>
							<description>Reset IDLE Flag</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit IDLE in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RWHE</name>
							<description>Reset Wrong Hall Event Flag</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit WHE in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCHE</name>
							<description>Reset Correct Hall Event Flag</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CHE in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTRPF</name>
							<description>Reset Trap Flag</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit TRPF in register IS will be reset (not taken into account while input CTRAP = 0 and TRPPEN = 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RT13PM</name>
							<description>Reset Timer T13 Period-Match Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit T13PM in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RT13CM</name>
							<description>Reset Timer T13 Compare-Match Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit T13CM in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RT12PM</name>
							<description>Reset Timer T12 Period-Match Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit T12PM in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RT12OM</name>
							<description>Reset Timer T12 One-Match Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit T12OM in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC62F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC62F in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC62R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC62R in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC61F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC61F in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC61R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC61R in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC60F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC60F in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC60R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC60R in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
