cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>NVIC_ISPR</name>
					<description>Interrupt Set-Pending</description>
					<addressOffset>0x200</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>Int_PORT2</name>
							<description>Interrupt Set Pending for PORT2</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_MON</name>
							<description>Interrupt Set Pending for MON</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_DU</name>
							<description>Interrupt Set Pending for Differential Unit</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_HS2</name>
							<description>Interrupt Set Pending for HS2</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_HS1</name>
							<description>Interrupt Set Pending for HS1</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_LS2</name>
							<description>Interrupt Set Pending for LS2</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_LS1</name>
							<description>Interrupt Set Pending for LS1</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_WAKEUP</name>
							<description>Interrupt Set Pending for WAKEUP</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_EXINT1</name>
							<description>Interrupt Set Pending for External Int 1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_EXINT0</name>
							<description>Interrupt Set Pending for External Int 0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_UART2</name>
							<description>Interrupt Set Pending for UART2</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_UART1</name>
							<description>Interrupt Set Pending for UART1</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_SSC2</name>
							<description>Interrupt Set Pending for SSC2</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_SSC1</name>
							<description>Interrupt Set Pending for SSC1</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR3</name>
							<description>Interrupt Set Pending for CCU6 SR3</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR2</name>
							<description>Interrupt Set Pending for CCU6 SR2</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR1</name>
							<description>Interrupt Set Pending for CCU6 SR1</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR0</name>
							<description>Interrupt Set Pending for CCU6 SR0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_ADC1</name>
							<description>Interrupt Set Pending for ADC1</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_ADC2</name>
							<description>Interrupt Set Pending for MU, ADC2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_GPT2</name>
							<description>Interrupt Set Pending for GPT2</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_GPT1</name>
							<description>Interrupt Set Pending for GPT1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
