cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>ICSR</name>
					<description>Interrupt Control and State Register</description>
					<addressOffset>0xD04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>NMIPENDSET</name>
							<description>NMI Set Pending</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>on writes, has no effect. On reads, NMI exception is not pending.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>on writes, changes the NMI exception state to pending. On reads, NMI exception is pending.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSVSET</name>
							<description>PENDSV Set Pending</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>on writes, has no effect. On reads, PendSV exception is not pending.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>on writes, changes PendSV exception state to pending. On reads, PendSV is pending.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSVCLR</name>
							<description>PENDSV Clear Pending</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>remove pending state from the PENDSV exception</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSTSET</name>
							<description>SysTick Exception Set Pending</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>on writes, has no effect. On reads, SysTick exception is not pending.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>on writes, changes SysTick exception state to pending. On reads, SysTick exception is pending.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSTCLR</name>
							<description>SysTick Exception Clear Pending</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>removes the pending state from the SysTick exception</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISRPENDING</name>
							<description>Interrupt Pending Flag</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>interrupt not pending</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTPENDING</name>
							<description>VECTPENDING</description>
							<lsb>12</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no pending exceptions</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTACTIVE</name>
							<description>VECTACTIVE</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Thread mode</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AIRCR</name>
					<description>Application Interrupt/Reset Control Register</description>
					<addressOffset>0xD0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VECTKEY</name>
							<description>Vector Key</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDIANNESS</name>
							<description>Data Endianness</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>little endian</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>big endian</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSRESETREQ</name>
							<description>System Reset Request</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>request a system level reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTCLRACTIVE</name>
							<description>VECTCLRACTIVE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCR</name>
					<description>System Control Register</description>
					<addressOffset>0xD10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SEVONPEND</name>
							<description>SEVONPEND</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>only enabled interrupts or events can wake-up the processor, disabled interrupts are excluded</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enabled events and all interrupts, including disabled interrupts, can wake-up the processor</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEEPDEEP</name>
							<description>Sleep Deep</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>sleep</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>deep sleep</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEEPONEXIT</name>
							<description>Sleep on Exit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>do not sleep when returning to Thread mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enter sleep, or deep sleep, on return from an ISR to Thread mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Configuration Control Register</description>
					<addressOffset>0xD14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STKALIGN</name>
							<description>STKALIGN</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UNALIGN_TRP</name>
							<description>UNALIGN_TRP</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHPR2</name>
					<description>System Handler Priority Register 2</description>
					<addressOffset>0xD1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_11</name>
							<description>Priority of System Handler 11, SVCall</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHPR3</name>
					<description>System Handler Priority Register 3</description>
					<addressOffset>0xD20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_15</name>
							<description>Priority of System Handler 15, SysTick</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_14</name>
							<description>Priority of System Handler 14, PendSV</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
