cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>IRQEN</name>
					<description>High Side Driver Interrupt Enable Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS2_OC_IEN</name>
							<description>High Side 2 Overcurrent interrupt enable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OL_IEN</name>
							<description>High Side 2 Open Load interrupt enable</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OT_IEN</name>
							<description>High Side 2 Overtemperature interrupt enable</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_IEN</name>
							<description>High Side 1 Overcurrent interrupt enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OL_IEN</name>
							<description>High Side 1 Open Load interrupt enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OT_IEN</name>
							<description>High Side 1 Overtemperature interrupt enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMSRCSEL</name>
					<description>High Side PWM Source Selection Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS1_SRC_SEL</name>
							<description>HS1 PWM Source Selection</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>PWM output of CCU6</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>PWM output of CCU6</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>PWM output of GPT12</description>
									<value>0b0110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_SRC_SEL</name>
							<description>HS2 PWM Source Selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>PWM output of CCU6</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>PWM output of CCU6</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>PWM output of GPT12</description>
									<value>0b0110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HS1_TRIM</name>
					<description>High Side Driver 1 TRIM</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS1_OC_OT_BTFILT_SEL</name>
							<description>Blanking Time Filter Select for HS1 Overcurrent / Overtemperature Detection</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OL_BTFILT_SEL</name>
							<description>Blanking Time Filter Select for HS1 Open Load Detection</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HS2_TRIM</name>
					<description>High Side Driver 2 TRIM</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS2_OC_OT_BTFILT_SEL</name>
							<description>Blanking Time Filter Select for HS2 Overcurrent / Overtemperature Detection</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OL_BTFILT_SEL</name>
							<description>Blanking Time Filter Select for HS2 Open Load Detection</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
