cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>LIN</name>
			<description>LIN</description>
			<baseAddress>0x4801E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL</name>
					<description>LIN Transceiver Control</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HV_MODE</name>
							<description>LIN Transceiver High Voltage Input - Output Mode</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>High Voltage Mode Entry is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>High Voltage Mode Entry is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FB_SM3</name>
							<description>Feedback Signal 3 for Slope Mode Setting</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FB_SM2</name>
							<description>Feedback Signal 2 for Slope Mode Setting</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FB_SM1</name>
							<description>Feedback Signal 1 for Slope Mode Setting</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SM</name>
							<description>LIN Transmitter Slope mode control</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Slope Mode</name>
									<description>for max. 20 kBaud</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Fast Slope Mode</name>
									<description>for max. 40 kBaud</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Low Slope Mode</name>
									<description>for max. 10.4 kBaud</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Flash Mode</name>
									<description>for max. 150 kBaud#</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXD</name>
							<description>Output Signal of Receiver</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXD</name>
							<description>LIN Transmitter switch on (only used when LIN_HV_MODE is set)</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull Down LIN Line</name>
									<description>Transmitter is switched on</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull Up Resistor is active</name>
									<description>Transmitter is switched off</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE_FB</name>
							<description>Feedback Signals for LIN Transmitter Mode Settings</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODE</name>
							<description>LIN transceiver power mode control</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LIN Sleep Mode</name>
									<description>LIN module switched to LIN Sleep Mode</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN Receive-Only Mode</name>
									<description>LIN module switched to LIN Receive Only Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN Normal Mode</name>
									<description>LIN module switched to LIN Normal Mode</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQS</name>
					<description>LIN Transceiver Interrupt Status</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TXD_TMOUT_STS</name>
							<description>LIN TXD time-out Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_TIMEOUT</name>
									<description>no time-out occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMEOUT</name>
									<description>time-out occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OT_STS</name>
							<description>LIN Receiver Overtemperature Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Overtemperature</name>
									<description>overtemperature occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>overtemperature occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M_SM_ERR_STS</name>
							<description>LIN Transceiver Mode Error - Slope Mode Error Status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Mode Error - Slope Mode</name>
									<description>status occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mode Error</name>
									<description>status occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXD_TMOUT_IS</name>
							<description>LIN TXD time-out Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_TIMEOUT</name>
									<description>no time-out occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMEOUT</name>
									<description>time-out occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OC_IS</name>
							<description>LIN Receiver Overcurrent Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Overcurrent</name>
									<description>overcurrent status occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overcurrent</name>
									<description>overcurrent status occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OT_IS</name>
							<description>LIN Receiver Overtemperature Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Overtemperature</name>
									<description>overtemperature occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>overtemperature occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M_SM_ERR_IS</name>
							<description>LIN Transceiver Mode Error - Slope Mode Error Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Mode Error - Slope Mode</name>
									<description>status occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mode Error</name>
									<description>status occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQCLR</name>
					<description>LIN Transceiver Interrupt Status Register Clear</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TXD_TMOUT_SC</name>
							<description>LIN TXD time-out Status Clear</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_Clear</name>
									<description>no time-out cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>time-out cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OT_SC</name>
							<description>LIN Receiver Overtemperature Status Clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_Clear</name>
									<description>overtemperature not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>overtemperature cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M_SM_ERR_SC</name>
							<description>LIN Transceiver Mode Error - Slope Mode Error Status Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_Clear</name>
									<description>overtemperature not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>overtemperature cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXD_TMOUT_ISC</name>
							<description>LIN TXD time-out Interrupt Status Clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_Clear</name>
									<description>no time-out cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>time-out cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OC_ISC</name>
							<description>LIN Receiver Overcurrent Interrupt Status Clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_Clear</name>
									<description>overcurrent status not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>overcurrent status cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OT_ISC</name>
							<description>LIN Receiver Overtemperature Interrupt Status / Status Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_Clear</name>
									<description>overtemperature not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>overtemperature cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M_SM_ERR_ISC</name>
							<description>LIN Transceiver Mode Error - Slope Mode Error Interrupt Status Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_Clear</name>
									<description>overtemperature not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>overtemperature cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQEN</name>
					<description>LIN Transceiver Interrupt Enable Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TXD_TMOUT_IEN</name>
							<description>LIN Transceiver TxD-Timeout interrupt enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OC_IEN</name>
							<description>LIN Transceiver Overcurrent interrupt enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OT_IEN</name>
							<description>LIN Transceiver Overtemperature interrupt enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M_SM_ERR_IEN</name>
							<description>LIN Transceiver Mode - Slope Mode Error interrupt enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
