cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>IRQEN</name>
					<description>Low Side Driver Interrupt Enable Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>LS2_OC_IEN</name>
							<description>Low-Side 2 Overcurrent interrupt enable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OL_IEN</name>
							<description>Low-Side 2 Open Load interrupt enable</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OT_IEN</name>
							<description>Low-Side 2 Overtemperature interrupt enable</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OT_PREWARN_IEN</name>
							<description>Low-Side 2 Overtemperature prewarn interrupt enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_IEN</name>
							<description>Low-Side 1 Overcurrent interrupt enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OL_IEN</name>
							<description>Low-Side 1 Open Load interrupt enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OT_IEN</name>
							<description>Low-Side 1 Overtemperature interrupt enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OT_PREWARN_IEN</name>
							<description>Low-Side 1 Overtemperature prewarn interrupt enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMSRCSEL</name>
					<description>Low Side PWM Source Selection Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>LS1_SRC_SEL</name>
							<description>LS1 PWM Source Selection</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>PWM output of CCU6</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>PWM output of CCU6</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>PWM output of GPT12</description>
									<value>0b0110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_SRC_SEL</name>
							<description>LS2 PWM Source Selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>PWM output of CCU6</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>PWM output of CCU6</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>PWM output of GPT12</description>
									<value>0b0110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LS1_TRIM</name>
					<description>Low Side Trimming Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>LS1_OC_BTFILT_SEL</name>
							<description>Overcurrent BlankTime Select for LS1</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OL_BTFILT_SEL</name>
							<description>Open load Blank Time Select for LS1</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LS2_TRIM</name>
					<description>Low Side Trimming Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>LS2_OC_BTFILT_SEL</name>
							<description>Overcurrent BlankTime Select for LS2</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OL_BTFILT_SEL</name>
							<description>Open load Blank Time Select for LS2</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
