cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>MODSUSP</name>
					<description>Module Suspend Control Register</description>
					<addressOffset>0x0C8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ADC1_SUSP</name>
							<description>ADC1 Unit Debug Suspend Bit</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ADC1 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>ADC1 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MU_SUSP</name>
							<description>Measurement Unit Debug Suspend Bit</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MU will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MU will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT1SUSP</name>
							<description>Watchdog Timer 1 Debug Suspend Bit</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>WDT1 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>WDT1 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T21_SUSP</name>
							<description>Timer21 Debug Suspend Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer21 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer21 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT12_SUSP</name>
							<description>GPT12 Debug Suspend Bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>GPT12 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>GPT12 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2_SUSP</name>
							<description>Timer2 Debug Suspend Bit</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer2 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer2 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13SUSP</name>
							<description>Timer 13 Debug Suspend Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer 13 in Capture/Compare Unit will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer 13 in Capture/Compare Unit will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12SUSP</name>
							<description>Timer 12 Debug Suspend Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer 12 in Capture/Compare Unit will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer 12 in Capture/Compare Unit will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BCON1</name>
					<description>Baud Rate Control Register 1</description>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BR1_PRE</name>
							<description>Prescaler Bit</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fDIV = fPCLK</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fDIV = fPCLK/2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fDIV = fPCLK/4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fDIV = fPCLK/8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fDIV = fPCLK/16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fDIV = fPCLK/32</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BR1_R</name>
							<description>Baud Rate Generator Run Control Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Baud-rate generator disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Baud-rate generator enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BCON2</name>
					<description>Baud Rate Control Register 2</description>
					<addressOffset>0x098</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BR2_PRE</name>
							<description>Prescaler Bit</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fDIV = fPCLK</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fDIV = fPCLK/2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fDIV = fPCLK/4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fDIV = fPCLK/8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fDIV = fPCLK/16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fDIV = fPCLK/32</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BR2_R</name>
							<description>Baud Rate Generator Run Control Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Baud-rate generator disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Baud-rate generator enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BGL1</name>
					<description>Baud Rate Timer/Reload Register, Low Byte 1</description>
					<addressOffset>0x08C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BG1_FD_SEL</name>
							<description>Fractional Divider Selection</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BGL2</name>
					<description>Baud Rate Timer/Reload Register, Low Byte 2</description>
					<addressOffset>0x09C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BG2_FD_SEL</name>
							<description>Fractional Divider Selection</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BG1</name>
					<description>Baud Rate Timer/Reload Register</description>
					<addressOffset>0x090</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BG1_BR_VALUE</name>
							<description>Baud Rate Timer/Reload Value UART1</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Baud-rate timer is bypassed.</description>
									<value>0x000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1</description>
									<value>0x001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2</description>
									<value>0x002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>2046</description>
									<value>0x7FE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>2047</description>
									<value>0x7FF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BG2</name>
					<description>Baud Rate Timer/Reload Register</description>
					<addressOffset>0x0A0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BG2_BR_VALUE</name>
							<description>Baud Rate Timer/Reload Value UART2</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Baud-rate timer is bypassed.</description>
									<value>0x000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1</description>
									<value>0x001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2</description>
									<value>0x002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>2046</description>
									<value>0x7FE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>2047</description>
									<value>0x7FF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LINST</name>
					<description>LIN Status Register</description>
					<addressOffset>0x094</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SYNEN</name>
							<description>End of SYN Byte and SYN Byte Error Interrupts Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>End of SYN Byte and SYN Byte Error Interrupts are not enabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>End of SYN Byte and SYN Byte Error Interrupts are enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERRSYN</name>
							<description>SYN Byte Error Interrupt Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Error is not detected in SYN Byte.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Error is detected in SYN Byte.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOFSYN</name>
							<description>End of SYN Byte Interrupt Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>End of SYN Byte is not detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>End of SYN Byte is detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BRK</name>
							<description>Break Field Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Break Field is not detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Break Field is detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BGSEL</name>
							<description>Baud Rate Select for Detection</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRDIS</name>
							<description>Baud Rate Detection Disable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Break/Synch detection is enabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Break/Synch detection is disabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LINSCLR</name>
					<description>LIN Status Clear Register</description>
					<addressOffset>0x0A4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ERRSYNC</name>
							<description>SYN Byte Error Interrupt Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Error in SYN Byte not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Error in SYN Byte cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOFSYNC</name>
							<description>End of SYN Byte Interrupt Flag Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>End of SYN Byte is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>End of SYN Byte is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BRKC</name>
							<description>Break Field Flag Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Break Field is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Break Field is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EDCCON</name>
					<description>Error Detection and Correction Control Register</description>
					<addressOffset>0x0D4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>NVMIE</name>
							<description>NVM Double Bit ECC Error Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No NMI is generated when a double bit ECC error occurs reading NVM.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>An NMI is generated when a double bit ECC error occurs reading NVM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIE</name>
							<description>RAM Double Bit ECC Error Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No NMI is generated when a double bit ECC error occurs reading RAM.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>An NMI is generated when a double bit ECC error occurs reading RAM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EDCSTAT</name>
					<description>Error Detection and Correction Status Register</description>
					<addressOffset>0x0D8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RSBE</name>
							<description>RAM Single Bit Error</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No single bit error on RAM has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A single bit error on RAM has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVMDBE</name>
							<description>NVM Double Bit Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No double bit error on NVM has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A double bit error on NVM has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDBE</name>
							<description>RAM Double Bit Error</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No double bit error on RAM has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A double bit error on RAM has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
