cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
				<register>
					<name>EDCSCLR</name>
					<description>Error Detection and Correction Status Clear Register</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RSBEC</name>
							<description>RAM Single Bit Error Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A single bit error on RAM is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A single bit error on RAM is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVMDBEC</name>
							<description>NVM Double Bit Error Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A double bit error on NVM is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A double bit error on NVM is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDBEC</name>
							<description>RAM Double Bit Error Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A double bit error on RAM is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A double bit error on RAM is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PASSWD</name>
					<description>Password Register</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PASS</name>
							<description>Password Bits</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Enables writing of the bit field MODE.</description>
									<value>0b11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Opens access to writing of all protected bits.</description>
									<value>0b10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Closes access to writing of all protected bits.</description>
									<value>0b10101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROTECT_S</name>
							<description>Bit-Protection Signal Status Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Software is able to write to all protected bits.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Software is unable to write to any protected bits.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW_MODE</name>
							<description>Bit-Protection Scheme Control Bit</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Scheme Disabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Scheme Enabled (default)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_STRTUP_STS</name>
					<description>System Startup Status Register</description>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PG100TP_CHKS_ERR</name>
							<description>100 TP Page Checksum Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MRAMINITSTS</name>
							<description>Map RAM Initialisation Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INIT_FAIL</name>
							<description>Initialization at startup failed</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVM_PROT_STS</name>
					<description>NVM Protection Status Register</description>
					<addressOffset>0x0E0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>NVMBSL</name>
							<description>CBSL Region Size Definition</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CBSL Size is 4K</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CBSL Size is 8K</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CBSL Size is 12K</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CBSL Size is 16K</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CBSL_PW</name>
							<description>Status of CBSL Region Password / Protection</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CBSL Region Password is not installed; CBSL region is not protected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CBSL Region Password is installed; CBSL region is protected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_PW</name>
							<description>Status of Linear Region Password / Protection</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Linear Region Password is not installed; Linear region is not protected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Linear Region Password is installed; Linear region is protected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NL_PW</name>
							<description>Status of Non-Linear Region Password / Protection</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Non-Linear Region Password is not installed; Linear region is not protected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Non-Linear Region Password is installed; Linear region is protected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIS_RDUS_S0</name>
							<description>Configuration of NVM Read Protection for Sector 0 with EN_RD_S0 = 0</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>only active when nvm_read_S0_unsafe_i = 1 and not for nvm_read_S0_unsafe_i = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>independent from nvm_read_S0_unsafe_i; Also write accesess to Sector 0 are prevented</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIS_RDUS</name>
							<description>Configuration of NVM Read Protection for Sector 1...n with EN_RD_* = 0</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>only active when nvm_read_unsafe_i = 1 and not for nvm_read_unsafe_i = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>independent from nvm_read_unsafe_i; Also write accesess to Sector 1...n are prevented</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_S0</name>
							<description>NVM Read Protection for Sector 0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data in sector 0 can not be read over AHB-Lite Interface</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data in sector 0 can be read over AHB-Lite Interface</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_CBSL</name>
							<description>NVM Read Protection of Data in CBSL Region</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data in region defined by NVMBSL can not be read</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data in region defined by NVMBSL sectors of can be read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_LIN</name>
							<description>NVM Read Protection of Data in Linear Sectors</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data in sectors of the linearly mapped area can not be read</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data in sectors of the linearly mapped area can be read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_NL</name>
							<description>NVM Read Protection of Data in Non-Linear Sectors</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data in sectors of the non-linearly mapped area can not be read</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data in sectors of the non-linearly mapped area can be read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PRG_CBSL</name>
							<description>NVM Protection of Data in CBSL Region</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data in region defined by NVMBSL can not be changed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data in region defined by NVMBSL can be changed (erased or written)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PRG_LIN</name>
							<description>NVM Protection of Data in Linear Sectors</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data in sectors of the linearly mapped area can not be changed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data in sectors of the linearly mapped area can be changed (erased or written)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PRG_NL</name>
							<description>NVM Protection of Data in Non-Linear Sectors</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data in sectors of the non-linearly mapped area can not be changed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data in sectors of the non-linearly mapped area can be changed (erased or written)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MEM_ACC_STS</name>
					<description>Memory Access Status Register</description>
					<addressOffset>0x0E4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ROM_PROT_ERR</name>
							<description>ROM Access Protection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_SFR_ADDR_ERR</name>
							<description>NVM SFR Address Protection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_SFR_PROT_ERR</name>
							<description>NVM SFR Access Protection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_ADDR_ERR</name>
							<description>NVM Address Protection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_PROT_ERR</name>
							<description>NVM Access Protection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Identity Register</description>
					<addressOffset>0x0A8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRODID</name>
							<description>Product ID</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VERID</name>
							<description>Version ID</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMSTAT</name>
					<description>Memory Status Register</description>
					<addressOffset>0x0DC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SASTATUS</name>
							<description>Service Algorithm Status</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Depending on SECTORINFO, there are two possible outcomes: For SECTORINFO = 00H, NVM initialization is successful and no SA is executed. For SECTORINFO = values other than 00H, SA execution is successful and only one map error is fixed.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>SA execution is successful. More than one mapping error is fixed.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>SA execution is not successful. Map error exists in the mapped sector.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>SA execution is not successful. Map error exists in the mapped sector.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SECTORINFO</name>
							<description>Sector Information</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMOP</name>
					<description>Emergency and Program Operation Status Register</description>
					<addressOffset>0x0CC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>EMPROP</name>
							<description>Emergency Program Operation Status Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No emergency program operation is started</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Emergency program operation is started</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVMPROP</name>
							<description>NVM Program Operation Status Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No NVM program operation is started</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>NVM program operation is started.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
