cmsis-svd/cmsis-svd/data/Infineon/TLE984x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>TIMER2</name>
			<description>TIMER2</description>
			<baseAddress>0x48004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MOD</name>
					<description>Timer 2 Mode Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T2REGS</name>
							<description>Edge Select for Timer 2 External Start</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>FALLING</name>
									<description>The falling edge at Pin T2EX is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>The rising edge at Pin T2EX is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2RHEN</name>
							<description>Timer 2 External Start Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer 2 External Start is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer 2 External Start is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGESEL</name>
							<description>Edge Select in Capture Mode/Reload Mode</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>FALLING</name>
									<description>The falling edge at Pin T2EX is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING</name>
									<description>The rising edge at Pin T2EX is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PREN</name>
							<description>Prescaler Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Prescaler is disabled and the 2 or 12 divider takes effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Prescaler is enabled (see T2PRE bit) and the 2 or 12 divider is bypassed.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2PRE</name>
							<description>Timer 2 Prescaler Bit</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>fT2 = fsys</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>fT2 = fsys / 2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>DfT2 = fsys / 4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>fT2 = fsys / 8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>fT2 = fsys / 16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>fT2 = fsys / 32</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>fT2 = fsys / 64</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>fT2 = fsys / 128</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCEN</name>
							<description>Up/Down Counter Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Up/Down Counter function is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Up/Down Counter function is enabled and controlled by pin T2EX (Up = 1, Down = 0)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CON</name>
					<description>Timer 2 Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TF2</name>
							<description>Timer 2 Overflow/Underflow Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EXF2</name>
							<description>Timer 2 External Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EXEN2</name>
							<description>Timer 2 External Enable Control</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>External events are disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>External events are enabled in Capture/Reload Mode.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TR2</name>
							<description>Timer 2 Start/Stop Control</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Timer 2.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Timer 2.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C_T2</name>
							<description>Timer or Counter Select</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Timer</name>
									<description>function selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Count</name>
									<description>upon negative edge at pin T2.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP_RL2</name>
							<description>Capture/Reload Select</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Reload</name>
									<description>upon overflow or upon negative/positive transition at pin T2EX (when EXEN2 = 1).</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Capture</name>
									<description>Timer 2 data register contents on the negative/positive transition at pin T2EX, provided EXEN2 = 1.The negative or positive transition at Pin T2EX is selected by bit EDGESEL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ICLR</name>
					<description>Timer 2 Interrupt Clear Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TF2CLR</name>
							<description>Overflow/Underflow Interrupt Clear Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>N/A</name>
									<description>Overflow/underflow interrupt is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Overflow/underflow interrupt</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXF2CLR</name>
							<description>External Interrupt Clear Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>N/A</name>
									<description>External interrupt is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>External interrupt</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CON1</name>
					<description>Timer 2 Control Register 1</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TF2EN</name>
							<description>Overflow/Underflow Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Overflow/underflow interrupt.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Overflow/underflow interrupt.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXF2EN</name>
							<description>External Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>External interrupt.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>External interrupt</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RC</name>
					<description>Timer 2 Reload/Capture Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RCH2</name>
							<description>Reload/Capture Value</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RCL2</name>
							<description>Reload/Capture Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Timer 2 Count Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T2H</name>
							<description>Timer 2 Value</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2L</name>
							<description>Timer 2 Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
